
<policyDefinitionResources revision="1.0" schemaVersion="1.0">

  <displayName>
  </displayName>
  <description>
  </description>

  <resources>
    <stringTable>
      <string id="Name_ECSCommunicationEnabled">Kommunikation aktivieren und Herunterladen von Experimenten</string>
      <string id="Sup_EdgeUpdate1_3_133_3">Microsoft Edge Update 1.3.133.3 und höher</string>
      <string id="Part_UninstallEdgePolicy">Deinstallieren der Microsoft Edge-Richtlinie</string>
      <string id="Pol_ProxyMode">Festlegen der Angabe von Proxyservereinstellungen</string>
      <string id="Name_ForceInstallsMachine">Installationen erzwingen (computerweit)</string>
      <string id="Name_ManualUpdatesOnly">Nur manuelle Updates</string>
      <string id="Pol_EdgePreview">Registrierung von Benutzern im Windows-Insider-Programm in Edge Preview zulassen</string>
      <string id="Name_UninstallEdgeDisabled">Deaktiviert</string>
      <string id="Sup_GoogleUpdate1_3_21_81">Microsoft Edge Update 1.3.21.81 und höher</string>
      <string id="Explain_Applications">Zur Unterstützung von Edge-Anwendungen, die in Zukunft veröffentlicht werden, ist eine aktualisierte ADMX/ADML-Vorlage erforderlich.</string>
      <string id="Name_DesktopShortcutDisabled">Erstellen von Desktopverknüpfungen bei der Installation verhindern</string>
      <string id="Pol_DefaultRemoveDesktopShortcut">Entfernen von Desktopverknüpfungen beim Aktualisieren der Standardeinstellung</string>
      <string id="ProxyFixedServers_DropDown">Feste Proxyserver verwenden</string>
      <string id="TargetChannel_Dev_DropDown">Entwickler</string>
      <string id="Sup_EdgeUpdate1_3_145_1">Microsoft Edge Update 1.3.145.1 und höher</string>
      <string id="Pol_ECSControl">Kommunikation des Updaters mit Experimentier- und Konfigurationsdienst steuern</string>
      <string id="Explain_ECSControl">In Microsoft Edge Update wird der Experimentier- und Konfigurationsdienst zur Bereitstellung von Experimentierpayload verwendet.

Die Experimentierpayload besteht aus einer Liste früher in der Entwicklung befindlicher Funktionen, die Microsoft zum Testen und für Feedback aktiviert.

Wenn Sie diese (1) Richtlinie aktivieren, wird die Experimentierpayload vom Experimentier- und Konfigurationsdienst heruntergeladen.

Wenn Sie diese (0) Richtlinie deaktivieren, wird die Kommunikation mit dem Experimentier- und Konfigurationsdienst vollständig beendet.

Wenn Sie diese Richtlinie nicht konfigurieren, ist das Verhalten auf einem verwalteten Gerät dasselbe wie bei deaktivierter Richtlinie.

Wenn Sie diese Richtlinie nicht konfigurieren, ist das Verhalten auf einem nicht verwalteten Gerät dasselbe wie bei aktivierter Richtlinie.</string>
      <string id="Name_InstallsDisabled">Installationen deaktiviert</string>
      <string id="Pol_TargetChannel">Außerkraftsetzung des Zielkanals</string>
      <string id="Pol_AllowInstallation">Installation zulassen</string>
      <string id="Name_UninstallEdgeEnabledAndDeleteData">Aktiviert und Löschen von Benutzerdaten</string>
      <string id="Explain_CreateDesktopShortcut">Wenn Sie diese (1) Richtlinie aktivieren, wird beim Installieren von Microsoft Edge eine Desktopverknüpfung erstellt.
  Wenn Sie diese (0) Richtlinie deaktivieren, wird beim Installieren von Microsoft Edge keine Desktopverknüpfung erstellt.
  Wenn Sie diese Richtlinie nicht konfigurieren, wird während der Installation eine Desktopverknüpfung mit Microsoft Edge erstellt.
  Wenn Microsoft Edge bereits installiert ist, hat diese Richtlinie keine Auswirkung.

  Wenn Sie diese Richtlinie nicht für einen Kanal konfigurieren, wird bei der Installation von Microsoft Edge die Erstellung einer Verknüpfung von der -Richtlinienkonfiguration „Desktopverknüpfung standardmäßig bei der Installation erstellen“ bestimmt.</string>
      <string id="Sup_EdgeUpdate1_3_119_43">Microsoft Edge-Update 1.3.119.43 und höher</string>
      <string id="Pol_AllowSideBySideExperience">Funktion „Nebeneinander“ für Microsoft Edge-Browser zulassen</string>
      <string id="Explain_AutoUpdateCheckPeriod">Mindestanzahl von Minuten zwischen automatischen Updateüberprüfungen.

Legen Sie diese Richtlinie auf den Wert 0 fest, um den gesamten regelmäßigen Netzwerkdatenverkehr durch Microsoft Edge Update zu deaktivieren. Dies wird nicht empfohlen, da dadurch verhindert wird, dass Microsoft Edge Update selbst Stabilitäts- und Sicherheitsupdates empfängt.

Anstelle dieser Einstellung sollten die Einstellungen „Standardeinstellung für Richtlinienüberschreibung aktualisieren“ und „Richtlinienüberschreibung aktualisieren“ pro Anwendung zum Verwalten von Anwendungsupdates verwendet werden.

Die Werte für diese Richtlinie können zwischen 0 und 43200 liegen.</string>
      <string id="TargetChannel_Extended_Stable_DropDown">Stabil (Erweitert)</string>
      <string id="Explain_DefaultUpdatePolicy">Hiermit können Sie das Standardverhalten für alle Kanäle angeben, die festlegen, wie Microsoft Edge Update die verfügbaren Updates für Microsoft Edge behandelt. Kann für einzelne Kanäle außer Kraft gesetzt werden, indem die Richtlinie „Überschreibung der Update-Richtlinie“ für diese spezifischen Kanäle angegeben wird.

Wenn Sie diese Richtlinie aktivieren, werden Microsoft Edge-Updates von Microsoft Edge Update entsprechend der Konfiguration der folgenden Optionen verarbeitet:
  – Updates deaktiviert (0): Updates werden nie angewendet.
  – Updates immer zulassen (1) (empfohlen): Jedes gefundene Update wird angewendet, sowohl bei regelmäßigen als auch bei manuellen Prüfungen auf Updates.
  – Nur manuelle Updates (2): Updates werden nur angewendet, wenn der Benutzer manuell nach Updates sucht.
  – Nur automatische unbeaufsichtigte Updates (3): Updates werden nur angewendet, wenn sie bei der regelmäßigen Überprüfung auf Updates gefunden werden.

Wenn Sie „Manuelle Updates“ auswählen, sollten Sie mithilfe des manuellen Updatemechanismus der App (falls verfügbar) regelmäßig nach Updates suchen. Wenn Sie Updates deaktivieren, sollten Sie regelmäßig nach Updates suchen und diese an die Benutzer verteilen.

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden die verfügbaren Updates von Microsoft Edge Update gemäß der Richtlinie „Überschreibung der Update-Richtlinie“ behandelt.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_WebView_AutoUpdate">Sie können angeben, ob automatische Updates für WebView2-Runtime aktiviert sind. WebView2-Runtime ist eine Komponente, die von Anwendungen zum Anzeigen von Webinhalten verwendet wird.
  Automatische Updates sind standardmäßig für WebView2-Runtime aktiviert. Durch das Deaktivieren von automatischen Updates für WebView2-Runtime können Kompatibilitätsprobleme mit Anwendungen verursacht werden, die von dieser Komponente abhängig sind.

  Wenn Sie diese Richtlinie aktivieren, verarbeitet Microsoft Edge Update WebView2-Runtime-Updates, abhängig davon, wie Sie die folgenden Optionen konfigurieren:
  – Updates immer zulassen (1): Updates werden automatisch heruntergeladen und installiert
  – Updates deaktiviert (0): Updates werden niemals heruntergeladen oder installiert

  Wenn Sie diese Richtlinie nicht aktivieren, werden Updates automatisch heruntergeladen und angewendet.</string>
      <string id="Sup_GoogleUpdate1_3_34_3">Microsoft Edge Update 1.3.34.3 und höher</string>
      <string id="Name_MeteredUpdatesEnabled">Getaktete Updates zulässig</string>
      <string id="ProxyAutoDetect_DropDown">Proxyeinstellungen automatisch erkennen</string>
      <string id="ProxyPacScript_DropDown">PAC-Proxyskript verwenden</string>
      <string id="Sup_EdgeUpdate1_3_179_5">Microsoft Edge-Update 1.3.179.5 und höher</string>
      <string id="DownloadPreference_DropDown">Zwischenspeicherbare Download-URLs</string>
      <string id="Name_ForceInstallsUser">Installationen erzwingen (pro Benutzer)</string>
      <string id="Explain_AllowSideBySideExperience">Mit dieser Richtlinie kann ein Benutzer Microsoft Edge (Edge HTML) und Microsoft Edge (Chromium-basiert) nebeneinander ausführen.

Wenn diese Richtlinie auf „Nicht konfiguriert“ festgelegt ist, wird Microsoft Edge (Edge HTML) durch Microsoft Edge (Chromium-basiert) ersetzt, sobald der stabile Kanal von Microsoft Edge (Chromium-basiert) und die Sicherheitsupdates von November 2019 installiert wurden.  Dies ist das gleiche Verhalten wie bei der Einstellung „Deaktiviert“.

Mit der Einstellung „Deaktiviert“ (0) wird die Nebeneinander-Funktion blockiert, und Microsoft Edge (Edge HTML) wird durch Microsoft Edge (Chromium-basiert) ersetzt, sobald der stabile Kanal von Microsoft Edge (Chromium-basiert) und die Sicherheitsupdates von November 2019 installiert wurden.  Dies ist das gleiche Verhalten wie bei der Einstellung „Nicht konfiguriert“.

Wenn für diese Richtlinie „Aktiviert“ festgelegt ist (1), können Microsoft Edge (Chromium-basiert) und Microsoft Edge (Edge HTML) nebeneinander ausgeführt werden, sobald Microsoft Edge (Chromium-basiert) installiert wurde.

Damit diese Gruppenrichtlinie wirksam wird, muss sie konfiguriert werden, bevor die automatische Installation von Microsoft Edge (Chromium-basiert) von Windows Update durchgeführt wird. Hinweis: ​Ein Benutzer kann das automatische Update von Microsoft Edge (Chromium-basiert) blockieren, indem er das Blocker-Toolkit von Microsoft Edge (Chromium-basiert) verwendet.

Ab Windows 10 Version 20H2 werden die Vorgängerversion von Microsoft Edge und die Nebeneinander-Browserfunktion nicht mehr unterstützt.</string>
      <string id="Explain_RemoveDesktopShortcut">Wenn Sie diese Richtlinie auf „Erzwingen des Löschens von Desktopverknüpfungen auf Systemebene“ festlegen (1), werden alle vorhandenen Microsoft Edge Desktopverknüpfungen auf Systemebene gelöscht, wenn der Browser aktualisiert oder der Computer neu gestartet wird.
  Wenn Sie diese Richtlinie auf „Erzwingen des Löschens von Desktopverknüpfungen auf System- und Benutzerebene“ festlegen (2), werden alle vorhandenen Microsoft Edge Desktopverknüpfungen auf Systemebene gelöscht, wenn der Browser aktualisiert oder der Computer neu gestartet wird, und alle vorhandenen Desktopverknüpfungen auf Benutzerebene werden gelöscht, wenn der Browser aktualisiert wird. Dies schließt Desktopverknüpfungen auf Benutzerebene ein, die Benutzer möglicherweise selbst erstellt haben.
  Wenn Sie diese Richtlinie nicht konfigurieren oder deaktivieren (0), geschieht nichts mit vorhandenen Microsoft Edge Desktopverknüpfungen.

  Wenn Sie diese Richtlinie nicht für einen Kanal konfigurieren, bestimmt die Richtlinienkonfiguration „Entfernen von Desktopverknüpfungen beim Aktualisieren der Standardeinstellung“ das Entfernen von Desktopverknüpfungen.</string>
      <string id="ProxyDisabled_DropDown">Niemals einen Proxy verwenden</string>
      <string id="Pol_DefaultAllowInstallation">Standardeinstellung für Installation zulassen</string>
      <string id="Pol_ProxyPacUrl">URL zu einer Proxy-PAC-Datei</string>
      <string id="Cat_Applications">Anwendungen</string>
      <string id="Explain_ProxyPacUrl">Ermöglicht die Angabe einer URL für eine Datei für die automatische Proxykonfiguration (PAC-Datei).

  Wenn Sie diese Richtlinie aktivieren, können Sie eine URL für eine PAC-Datei angeben, die definiert, wie Microsoft Edge Update automatisch den passenden Proxyserver zum Abrufen einer bestimmten Website auswählt.

  Diese Richtlinie wird nur angewendet, wenn Sie die Option für manuelle Proxyeinstellungen in der Richtlinie „Auswählen, wie Proxyservereinstellungen angegeben werden sollen“ festgelegt haben.

  Konfigurieren Sie diese Richtlinie nicht, wenn Sie in der Richtlinie „Auswählen, wie Proxyservereinstellungen angegeben werden sollen“ eine andere Proxyeinstellung als „Manuell“ ausgewählt haben.</string>
      <string id="Sup_EdgeUpdate1_3_193_5">Microsoft Edge Update 1.3.193.5 und höher</string>
      <string id="TargetChannel_Beta_DropDown">Beta</string>
      <string id="Sup_EdgeUpdate1_3_168_21">Microsoft Edge Update 1.3.168.21 und höher</string>
      <string id="Explain_Preferences">Allgemeine Richtlinien für Microsoft Edge Update.</string>
      <string id="Explain_WebView">Gibt Richtlinien für die WebView2-Runtime an.</string>
      <string id="Name_DefaultMeteredUpdatesDisabled">Standardmäßige getaktete Updates deaktiviert</string>
      <string id="Sup_EdgeUpdate1_3_127_1">Microsoft Edge-Update 1.3.127.1 und höher</string>
      <string id="Explain_ProxyServer">Ermöglicht die Angabe der URL des Proxyservers, der von Microsoft Edge Update verwendet werden soll.

  Wenn Sie diese Richtlinie aktivieren, können Sie die Proxyserver-URL festlegen, die von Microsoft Edge Update in Ihrer Organisation verwendet wird.

  Diese Richtlinie wird nur angewendet, wenn Sie die Option für manuelle Proxyeinstellungen in der Richtlinie „Auswählen, wie Proxyservereinstellungen angegeben werden sollen“ ausgewählt haben.

  Konfigurieren Sie diese Richtlinie nicht, wenn Sie in der Richtlinie „Auswählen, wie Proxyservereinstellungen angegeben werden sollen“ eine andere Einstellung als „Manuell“ ausgewählt haben.</string>
      <string id="Pol_MeteredUpdates">Benutzern das Aktualisieren über getaktete Verbindungen gestatten</string>
      <string id="Name_UninstallEdgeNotConfigured">Nicht konfiguriert</string>
      <string id="Explain_DefaultAllowInstallation">Sie können das Standardverhalten aller Kanäle festlegen: ob Microsoft Edge auf mit Domänen verbundenen Geräten gestattet oder blockiert wird.

Sie können diese Richtlinie für einzelne Kanäle außer Kraft setzen, indem Sie die (1) Richtlinie „Installation zulassen“ für bestimmte Kanäle aktivieren.

Falls Sie diese (2) Richtlinie deaktivieren, wird die Installation von Microsoft Edge blockiert. Dies wirkt sich nur dann auf die Installation von Microsoft Edge-Software aus, wenn sie die Richtlinie „Installation zulassen“ nicht konfiguriert haben.

Diese Richtlinie verhindert nicht die Ausführung von Microsoft Edge Update und hindert Benutzer nicht daran, Microsoft Edge-Software durch andere Methoden zu installieren.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Sup_EdgeUpdate1_3_155_1">Microsoft Edge Update 1.3.155.1 und höher</string>
      <string id="TargetChannel_Stable_DropDown">Stabil</string>
      <string id="Cat_Google">Microsoft</string>
      <string id="Pol_DefaultUpdatePolicy">Standardeinstellung für die Überschreibung von Update-Richtlinien</string>
      <string id="Explain_ProxyMode">Ermöglicht es Ihnen, die Proxyservereinstellungen festzulegen, die von Microsoft Edge Update verwendet werden.

  Wenn Sie diese Richtlinie aktivieren, können Sie zwischen den folgenden Proxyserveroptionen wählen:
   – Wenn Sie sich entscheiden, nie einen Proxyserver zu verwenden und stets eine direkte Verbindung herzustellen, werden alle anderen Optionen ignoriert.
   – Wenn Sie sich entscheiden, die Systemproxyeinstellungen zu verwenden oder den Proxy Server automatisch zu erkennen, werden alle anderen Optionen ignoriert.
   – Wenn Sie den Modus für ein festes Serverproxy, können Sie weitere Optionen in der Richtlinie "Adresse oder URL eines Proxyservers" angeben.
   – Wenn Sie ein PAC-Proxyskript verwenden, müssen Sie die URL für das Skript in der Richtlinie "URL zu Proxy .PAC-Datei" angeben.

  Wenn Sie diese Richtlinie aktivieren, können die Benutzer in Ihrer Organisation die Proxyeinstellungen in Microsoft Edge-Update nicht ändern.

  Sie diese Richtlinie deaktivieren oder nicht konfigurieren, sind keine Proxyservereinstellungen konfiguriert, aber die Benutzer in Ihrer Organisation können Ihre eigenen Proxyeinstellungen für das Microsoft Edge-Update auswählen.</string>
      <string id="Sup_GoogleUpdate1_3_26_0">Microsoft Edge Update 1.3.26.0 und höher</string>
      <string id="Pol_RemoveDesktopShortcut">Entfernen von Desktopverknüpfungen beim Update</string>
      <string id="Sup_EdgeUpdate1_3_147_1">Microsoft Edge Update 1.3.147.1 und höher</string>
      <string id="Name_UpdatesDisabled">Updates deaktiviert</string>
      <string id="Pol_RollbackToTargetVersion">Wiederherstellung der Zielversion</string>
      <string id="Explain_WebView_Install">Hiermit können Sie angeben, ob WebView2-Runtime mithilfe Microsoft Edge Update installiert werden kann.

  Wenn Sie diese (1) Richtlinie aktivieren, können Benutzer WebView2-Runtime über Microsoft Edge Update installieren.

  Wenn Sie diese (0) Richtlinie deaktivieren (oder auf „Installationen deaktiviert“ festlegen), können Benutzer WebView2-Runtime nicht über Microsoft Edge Update installieren.

  Wenn Sie diese Richtlinie so festlegen, dass computerweite Installationen, aber keine Installationen pro Benutzer immer zulässig sind (4), wird WebView2-Runtime nur computerweit bereitgestellt.

  Wenn Sie die Richtlinie auf „Installation erzwingen (computerweit)“ festlegen (5), können Benutzer WebView2-Runtime auf allen Computern installieren, auf denen Microsoft Edge Update vorinstalliert ist. Erfordert Microsoft Edge Update 1.3.155.43 oder höher.

  Wenn Sie diese Richtlinie nicht konfigurieren, wird WebView2-Runtime über Microsoft Edge Update installiert.</string>
      <string id="Explain_GoogleUpdate">Richtlinien zum Steuern der Installation und Aktualisierung von Microsoft Edge mit Microsoft Edge Update.</string>
      <string id="Explain_DefaultRemoveDesktopShortcut">Ermöglicht es Ihnen, das Standardverhalten für alle Kanäle zur Erstellung einer Desktopverknüpfung anzugeben, wenn Microsoft Edge installiert wird.

  Wenn Sie diese Richtlinie auf „Erzwingen des Löschens von Desktopverknüpfungen auf Systemebene“ festlegen (1), werden alle vorhandenen Microsoft Edge Desktopverknüpfungen auf Systemebene gelöscht, wenn der Browser aktualisiert oder der Computer neu gestartet wird.
  Wenn Sie diese Richtlinie auf „Erzwingen des Löschens von Desktopverknüpfungen auf System- und Benutzerebene“ festlegen (2), werden alle vorhandenen Microsoft Edge Desktopverknüpfungen auf Systemebene gelöscht, wenn der Browser aktualisiert oder der Computer neu gestartet wird, und alle vorhandenen Desktopverknüpfungen auf Benutzerebene werden gelöscht, wenn der Browser aktualisiert wird. Dies schließt Desktopverknüpfungen auf Benutzerebene ein, die Benutzer möglicherweise selbst erstellt haben.
  Wenn Sie diese Richtlinie nicht konfigurieren oder deaktivieren (0), geschieht nichts mit vorhandenen Microsoft Edge Desktopverknüpfungen.</string>
      <string id="Explain_UpdateCheckSuppressedPeriod">Wenn Sie diese Richtlinie aktivieren, werden Updateüberprüfungen jeden Tag, beginnend bei "Stunde:Minute", für einen bestimmten Zeitraum (in Minuten) unterdrückt. Die Dauer ist von der Sommerzeit nicht betroffen. Wenn z. B. die Startzeit 22:00 Uhr ist und die Dauer 480 Minuten beträgt, werden Updates genau 8 Stunden lang unterdrückt, unabhängig davon, ob die Sommerzeit während dieses Zeitraums beginnt oder endet.

Wenn Sie diese Richtlinie deaktivieren oder nicht konfigurieren, werden Updateüberprüfungen während eines bestimmten Zeitraums nicht unterdrückt.

Die Werte für diese Richtlinie können zwischen 0 und 23 für Stunden, 0 bis 59 für Minuten und 0 bis 960 für die Dauer in Minuten liegen.</string>
      <string id="Name_UpdatesEnabled">Updates immer zulassen (empfohlen)</string>
      <string id="Cat_ProxyServer">Proxyserver</string>
      <string id="Pol_CreateDesktopShortcut">Desktopverknüpfung bei der Installation erstellen</string>
      <string id="Pol_AutoUpdateCheckPeriod">Überschreibung des Zeitraums der automatischen Updateüberprüfung</string>
      <string id="Sup_GoogleUpdate1_2_145_5">Microsoft Edge Update 1.2.145.5 und höher</string>
      <string id="Pol_DefaultCreateDesktopShortcut">Desktopverknüpfung standardmäßig bei der Installation erstellen</string>
      <string id="Name_DeleteSystemDesktopShortcuts">Erzwingen des Löschens von Desktopverknüpfungen auf Systemebene</string>
      <string id="Name_ECSCommunicationDisabled">Kommunikation mit Experimentier- und Konfigurationsdienst deaktivieren</string>
      <string id="Sup_GoogleUpdate1_3_33_5">Microsoft Edge Update 1.3.33.5 und höher</string>
      <string id="Name_InstallsEnabled">Installation immer zulassen (empfohlen)</string>
      <string id="Explain_DownloadPreference">Wenn diese Option aktiviert ist, versucht der Microsoft Edge Update-Server, in den Antworten cachefähige URLs für Updatenutzlasten bereitzustellen.</string>
      <string id="Name_AutomaticUpdatesOnly">Nur automatische Updates im Hintergrund</string>
      <string id="Pol_DefaultMeteredUpdates">Benutzern das Aktualisieren aller Apps über getaktete Verbindungen gestatten</string>
      <string id="Name_DefaultMeteredUpdatesEnabled">Standardmäßige getaktete Updates zulässig</string>
      <string id="Pol_TargetVersionPrefix">Außerkraftsetzung der Zielversion</string>
      <string id="Pol_UninstallEdge">Deinstallationsverhalten für Microsoft Edge angeben</string>
      <string id="Name_MeteredUpdatesDisabled">Getaktete Deaktivierung von Updates</string>
      <string id="Pol_DownloadPreference">Überschreiben der Download-URL-Klasse</string>
      <string id="Pol_UpdateCheckSuppressedPeriod">Zeitraum, für den die automatische Update-Überprüfung täglich unterdrückt wird</string>
      <string id="Sup_EdgeUpdate1_3_128_0">Microsoft Edge-Update 1.3.128.0 und höher</string>
      <string id="Cat_WebView">Microsoft Edge WebView2-Laufzeit</string>
      <string id="Pol_UpdatePolicy">Überschreibung der Update-Richtlinie</string>
      <string id="Name_UninstallEdgeEnabledAndKeepData">Aktiviert</string>
      <string id="Pol_ProxyServer">Adresse oder URL des Proxyservers</string>
      <string id="Explain_DefaultCreateDesktopShortcut">Ermöglicht es Ihnen, das Standardverhalten für alle Kanäle zur Erstellung einer Desktopverknüpfung anzugeben, wenn Microsoft Edge installiert wird.

  Wenn Sie diese (1) Richtlinie aktivieren, wird beim Installieren von Microsoft Edge eine Desktopverknüpfung erstellt.
  Wenn Sie diese (0) Richtlinie deaktivieren, wird beim Installieren von Microsoft Edge keine Desktopverknüpfung erstellt.
  Wenn Sie diese Richtlinie nicht konfigurieren, wird während der Installation eine Desktopverknüpfung mit Microsoft Edge erstellt.
  Wenn Microsoft Edge bereits installiert ist, hat diese Richtlinie keine Auswirkung.</string>
      <string id="Name_DeleteAllDesktopShortcuts">Erzwingen des Löschens von Desktopverknüpfungen auf System- und Benutzerebene</string>
      <string id="ProxyUseSystem_DropDown">Systemproxyeinstellungen verwenden</string>
      <string id="Cat_Preferences">Einstellungen</string>
      <string id="Name_InstallsEnabledMachineOnly">Computerweite Installationen immer zulassen, jedoch keine Pro-Benutzer-Installationen</string>
      <string id="Cat_GoogleUpdate">Microsoft Edge-Update</string>
      <string id="Explain_DefaultMeteredUpdatesPolicy">Gibt an, ob Microsoft Edge Update Verbindungen aktualisiert, die als getaktet gekennzeichnet sind, z. B. Mobilfunkverbindungen oder andere Verbindungen, bei denen die Datennutzung für alle Apps gesteuert wird. 

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden Updates basierend auf der Umschaltfläche „Updates über getaktete Verbindungen herunterladen“ auf der Seite „Info“ des Microsoft Edge-Browsers ausgeführt. Wenn ein Benutzer keine Auswahl trifft, wird die Windows-Einstellung verwendet. Weitere Informationen zur Windows-Einstellung finden Sie hier: https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Updates immer zulassen (2): Updates werden immer heruntergeladen, wenn sie gefunden werden, entweder durch automatische Updateüberprüfung oder durch manuelle Updateüberprüfung.

Updates deaktiviert (1): Updates werden nicht heruntergeladen, wenn eine getaktete Verbindung verwendet wird.</string>
      <string id="Cat_MicrosoftEdge">Microsoft Edge</string>
      <string id="Explain_InstallMicrosoftEdge">Gibt an, ob ein Microsoft Edge-Kanal auf einem mit einer Domäne verbunden Gerät installiert werden kann.

  Wenn Sie diese (1) Richtlinie für einen Kanal aktivieren, wird die Installation durch Microsoft Edge nicht blockiert.

  Wenn Sie diese (0) Richtlinie für einen Kanal deaktivieren, wird die Installation durch Microsoft Edge blockiert.

  Wenn Sie diese Richtlinie für einen Kanal nicht konfigurieren, bestimmt die Richtlinie „Standardeinstellung für Installation zulassen“, ob Benutzer diesen Microsoft Edge-Kanal installieren können.

Wenn Sie diese Richtlinie so festlegen, dass Machine-Wide Installationen, aber nicht Per-User Installationen (4) immer zugelassen werden, wird "APP_NAME" nur computerweit bereitgestellt.

Wenn Sie diese Richtlinie auf „Installation erzwingen (computerweit)“ festlegen (5), kann „APP_NAME“ nur computerweit bereitgestellt werden, wenn Microsoft Edge Update vorinstalliert ist. Erfordert Microsoft Edge Update 1.3.155.43 oder höher.

Wenn Sie diese Richtlinie auf „Installation erzwingen (pro Benutzer)“ festlegen (6), kann „APP_NAME“ auf allen Computern nur auf einer Pro-Benutzer-Basis bereitgestellt werden, wenn Microsoft Edge Update pro Benutzer vorinstalliert ist. Erfordert Microsoft Edge Update 1.3.155.43 oder höher.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_AutoUpdateMicrosoftEdge">Gibt an, wie Microsoft Edge Update mit verfügbaren Updates von Microsoft Edge umgeht.

Wenn Sie diese Richtlinie aktivieren, werden Microsoft Edge-Updates von Microsoft Edge Update entsprechend der Konfiguration der folgenden Optionen verarbeitet:
  – Updates deaktiviert (0): Updates werden nie angewendet.
  – Updates immer zulassen (1) (empfohlen): Jedes gefundene Update wird angewendet, sowohl bei regelmäßigen als auch bei manuellen Prüfungen auf Updates.
  – Nur manuelle Updates (2): Updates werden nur angewendet, wenn der Benutzer manuell nach Updates sucht. (Nicht alle Apps stellen eine Schnittstelle für diese Option bereit.)
  – Nur automatische unbeaufsichtigte Updates (3): Updates werden nur angewendet, wenn sie bei der regelmäßigen Überprüfung auf Updates gefunden werden.

Wenn Sie „Manuelle Updates“ auswählen, sollten Sie mithilfe des manuellen Updatemechanismus der App (falls verfügbar) regelmäßig nach Updates suchen. Wenn Sie Updates deaktivieren, sollten Sie regelmäßig nach Updates suchen und diese an die Benutzer verteilen.

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden die verfügbaren Updates von Microsoft Edge Update gemäß der Richtlinie „Standardeinstellung für die Überschreibung von Update-Richtlinien“ behandelt.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136406.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetChannelMicrosoftEdge">Gibt an, auf welchen Kanal Microsoft Edge aktualisiert werden soll.

Wenn Sie diese Richtlinie aktivieren, wird Microsoft Edge entsprechend Ihrer Konfiguration der folgenden Optionen auf den Kanal aktualisiert:

  – Stabil: Microsoft Edge wird auf die neueste stabile Version aktualisiert.
  – Beta: Microsoft Edge wird auf die neueste Betaversion aktualisiert.
  –Dev: Microsoft Edge wird auf die neueste Entwicklerversion aktualisiert.
  – Stabil (erweitert): Microsoft Edge wird auf die neueste erweiterte stabile Version aktualisiert, die einem längeren Releaseintervall folgt als die stabile Version. Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2163508.

Wenn Sie diese Richtlinie nicht konfigurieren, wird Microsoft Edge auf die neueste Version aktualisiert, die für den Standardkanal verfügbar ist.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdge">Wenn diese Richtlinie sowie die automatische Aktualisierung aktiviert sind, wird Microsoft Edge auf die Version aktualisiert, die durch diesen Richtlinienwert angegeben wird.

Bei dem Richtlinienwert muss es sich um eine bestimmte Microsoft Edge-Version handeln, z. B. 83.0.499.12.

Wenn auf einem Gerät eine neuere Microsoft Edge-Version als der angegebene Wert vorhanden ist, wird Microsoft Edge in der neueren Version belassen und nicht auf die angegebene Version herabgestuft.

Wenn die angegebene Version nicht vorhanden ist oder nicht ordnungsgemäß formatiert ist, wird Microsoft Edge in der aktuellen Version belassen und nicht automatisch auf zukünftige Versionen aktualisiert.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136707.

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die sich innerhalb einer Microsoft® Active Directory®-Domäne befinden.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdge">Gibt an, dass Microsoft Edge Update Installationen von Microsoft Edge auf die in „Außerkraftsetzung der Zielversion“ angegebene Version zurücksetzen sollen.

Diese Richtlinie hat keine Auswirkung, es sei denn, „Außerkraftsetzung der Zielversion“ ist festgelegt und „Überschreibung der Update-Richtlinie“ ist auf einen der On-Zustände festgelegt (Updates immer zulassen, nur automatische automatische Updates, nur manuelle Updates).

Wenn Sie diese Richtlinie deaktivieren (0) oder nicht konfigurieren, bleiben Installationen unverändert, deren Version höher ist als die von „Außerkraftsetzung der Zielversion“ angegebene Version.

Wenn Sie diese Richtlinie aktivieren (1), werden Installationen, deren aktuelle Version höher als im „Außerkraftsetzung der Zielversion“ angegeben ist, auf die Zielversion herabgestuft.

Es wird empfohlen, dass Benutzer die neueste Version des Microsoft Edge-Browsers installieren, um den Schutz durch die neuesten Sicherheitsupdates sicherzustellen. Bei einem Rollback auf eine frühere Version besteht die Gefahr, dass bekannte Sicherheitsprobleme auftreten. Diese Richtlinie soll als temporärer Fix verwendet werden, um Probleme in einem Microsoft Edge Browserupdate zu beheben.

Vor dem vorübergehenden Rollback Ihrer Browserversion empfehlen wir, die Synchronisierung (https://go.microsoft.com/fwlink/?linkid=2133032) für alle Benutzer in Ihrer Organisation zu aktivieren. Wenn Sie die Synchronisierung nicht aktivieren, besteht das Risiko eines dauerhaften Datenverlusts beim Browsen. Verwenden Sie diese Richtlinie auf eigenes Risiko.

Hinweis: Alle für das Rollback verfügbaren Versionen können hier https://aka.ms/EdgeEnterprise angezeigt werden.

Diese Richtlinie gilt für Microsoft Edge, Version 86 oder höher.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2133918.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_EdgePolicyMicrosoftEdge">Hiermit können Sie angeben, ob Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert sind.

  – Wenn Sie diese (1) Richtlinie aktivieren, werden Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert.

  – Wenn Sie diese (0) Richtlinie deaktivieren, können Benutzer im Windows-Insider-Programm nicht über Microsoft Edge Update in der Edge-Vorschau registriert werden.

  – Wenn Sie diese Richtlinie nicht konfigurieren, werden Benutzer im Windows-Insider-Programm standardmäßig über Microsoft Edge Update in der Edge-Vorschau registriert.</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdge">Gibt an, ob Microsoft Edge Update Verbindungen aktualisiert, die als getaktet gekennzeichnet sind, z. B. Mobilfunkverbindungen oder andere Verbindungen, bei denen die Datennutzung für den Microsoft Edge Browser gesteuert wird. 

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden Updates basierend auf der Umschaltfläche „Updates über getaktete Verbindungen herunterladen“ auf der Seite „Info“ des Microsoft Edge-Browsers ausgeführt. Wenn ein Benutzer keine Auswahl trifft, wird die Windows-Einstellung verwendet. Weitere Informationen zur Windows-Einstellung finden Sie hier: https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Updates immer zulassen (2): Updates werden immer heruntergeladen, wenn sie gefunden werden, entweder durch automatische Updateüberprüfung oder durch manuelle Updateüberprüfung.

Updates deaktivieren (1): Updates werden nicht heruntergeladen, wenn eine getaktete Verbindung verwendet wird.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdge">Sie können angeben, ob Microsoft Edge (stabiler Kanal) auf einer Domäne angehörenden Geräten im Europäischen Wirtschaftsraum (EWR) deinstalliert wird oder ob die Deinstallation blockiert wird.

Wenn diese Richtlinie auf „Aktiviert“ gesetzt ist, wird Microsoft Edge automatisch auf allen Geräten im EWR deinstalliert, auf denen diese Richtlinie angewendet wird. Benutzerdaten werden auf dem Gerät gespeichert. Microsoft Edge wird deinstalliert, wenn Microsoft Edge Update das nächste Mal automatisch nach Updates sucht. Wenn Microsoft Edge von den Geräten deinstalliert wird, sind Anwendungen, Widgets (z. B. Nachrichten, Suche und Wetter) oder andere progressive Webanwendungen (Progressive Web Applications, PWAs), die von Microsoft Edge abhängen, nicht mehr verfügbar.

Wenn diese Richtlinie auf „Aktiviert und Benutzerdaten löschen“ (Einstellung „2“) gesetzt ist, wird Microsoft Edge auf allen Geräten im EWR, auf denen diese Richtlinie angewendet wird, automatisch deinstalliert und die Benutzerdaten werden vom Gerät gelöscht.

Wenn diese Richtlinie auf „Deaktiviert“ (Einstellung „3“) gesetzt ist, können alle Benutzer im EWR dort, wo diese Richtlinie bereitgestellt wird, Microsoft Edge nicht deinstallieren.

Wenn die Richtlinie „Nicht konfiguriert“ (Standardeinstellung) ist, bestimmt die Windows-Regionaleinstellung eines Benutzers, ob er Microsoft Edge auf einem einer Domäne angehörenden Gerät deinstallieren kann. Nur Benutzer in EWR-Ländern können Microsoft Edge deinstallieren, wenn sie dies wünschen. Benutzer außerhalb dieses Gebiets können Microsoft Edge nicht deinstallieren. 

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die einer Microsoft® Active Directory®-Domäne beigetreten sind.

Wenn Microsoft Edge neu installiert werden muss:
– Sie können die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ setzen, um Microsoft Edge neu zu installieren.
– Wenn Sie die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ und die Deinstallationsrichtlinie auf „Aktiviert“ setzen, überschreibt die Richtlinie „Installationen erzwingen (computerübergreifend)“ die Deinstallationsrichtlinie.</string>
      <string id="Cat_MicrosoftEdgeBeta">Microsoft Edge Beta</string>
      <string id="Explain_InstallMicrosoftEdgeBeta">Gibt an, ob ein Microsoft Edge-Kanal auf einem mit einer Domäne verbunden Gerät installiert werden kann.

  Wenn Sie diese (1) Richtlinie für einen Kanal aktivieren, wird die Installation durch Microsoft Edge nicht blockiert.

  Wenn Sie diese (0) Richtlinie für einen Kanal deaktivieren, wird die Installation durch Microsoft Edge blockiert.

  Wenn Sie diese Richtlinie für einen Kanal nicht konfigurieren, bestimmt die Richtlinie „Standardeinstellung für Installation zulassen“, ob Benutzer diesen Microsoft Edge-Kanal installieren können.

Wenn Sie diese Richtlinie so festlegen, dass Machine-Wide Installationen, aber nicht Per-User Installationen (4) immer zugelassen werden, wird "APP_NAME" nur computerweit bereitgestellt.

Wenn Sie diese Richtlinie auf „Installation erzwingen (computerweit)“ festlegen (5), kann „APP_NAME“ nur computerweit bereitgestellt werden, wenn Microsoft Edge Update vorinstalliert ist. Erfordert Microsoft Edge Update 1.3.155.43 oder höher.

Wenn Sie diese Richtlinie auf „Installation erzwingen (pro Benutzer)“ festlegen (6), kann „APP_NAME“ auf allen Computern nur auf einer Pro-Benutzer-Basis bereitgestellt werden, wenn Microsoft Edge Update pro Benutzer vorinstalliert ist. Erfordert Microsoft Edge Update 1.3.155.43 oder höher.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeBeta">Gibt an, wie Microsoft Edge Update mit verfügbaren Updates von Microsoft Edge umgeht.

Wenn Sie diese Richtlinie aktivieren, werden Microsoft Edge-Updates von Microsoft Edge Update entsprechend der Konfiguration der folgenden Optionen verarbeitet:
  – Updates deaktiviert (0): Updates werden nie angewendet.
  – Updates immer zulassen (1) (empfohlen): Jedes gefundene Update wird angewendet, sowohl bei regelmäßigen als auch bei manuellen Prüfungen auf Updates.
  – Nur manuelle Updates (2): Updates werden nur angewendet, wenn der Benutzer manuell nach Updates sucht. (Nicht alle Apps stellen eine Schnittstelle für diese Option bereit.)
  – Nur automatische unbeaufsichtigte Updates (3): Updates werden nur angewendet, wenn sie bei der regelmäßigen Überprüfung auf Updates gefunden werden.

Wenn Sie „Manuelle Updates“ auswählen, sollten Sie mithilfe des manuellen Updatemechanismus der App (falls verfügbar) regelmäßig nach Updates suchen. Wenn Sie Updates deaktivieren, sollten Sie regelmäßig nach Updates suchen und diese an die Benutzer verteilen.

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden die verfügbaren Updates von Microsoft Edge Update gemäß der Richtlinie „Standardeinstellung für die Überschreibung von Update-Richtlinien“ behandelt.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136406.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeBeta">Gibt an, auf welchen Kanal Microsoft Edge aktualisiert werden soll.

Wenn Sie diese Richtlinie aktivieren, wird Microsoft Edge entsprechend Ihrer Konfiguration der folgenden Optionen auf den Kanal aktualisiert:

  – Stabil: Microsoft Edge wird auf die neueste stabile Version aktualisiert.
  – Beta: Microsoft Edge wird auf die neueste Betaversion aktualisiert.
  –Dev: Microsoft Edge wird auf die neueste Entwicklerversion aktualisiert.
  – Stabil (erweitert): Microsoft Edge wird auf die neueste erweiterte stabile Version aktualisiert, die einem längeren Releaseintervall folgt als die stabile Version. Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2163508.

Wenn Sie diese Richtlinie nicht konfigurieren, wird Microsoft Edge auf die neueste Version aktualisiert, die für den Standardkanal verfügbar ist.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeBeta">Wenn diese Richtlinie sowie die automatische Aktualisierung aktiviert sind, wird Microsoft Edge auf die Version aktualisiert, die durch diesen Richtlinienwert angegeben wird.

Bei dem Richtlinienwert muss es sich um eine bestimmte Microsoft Edge-Version handeln, z. B. 83.0.499.12.

Wenn auf einem Gerät eine neuere Microsoft Edge-Version als der angegebene Wert vorhanden ist, wird Microsoft Edge in der neueren Version belassen und nicht auf die angegebene Version herabgestuft.

Wenn die angegebene Version nicht vorhanden ist oder nicht ordnungsgemäß formatiert ist, wird Microsoft Edge in der aktuellen Version belassen und nicht automatisch auf zukünftige Versionen aktualisiert.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136707.

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die sich innerhalb einer Microsoft® Active Directory®-Domäne befinden.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeBeta">Gibt an, dass Microsoft Edge Update Installationen von Microsoft Edge auf die in „Außerkraftsetzung der Zielversion“ angegebene Version zurücksetzen sollen.

Diese Richtlinie hat keine Auswirkung, es sei denn, „Außerkraftsetzung der Zielversion“ ist festgelegt und „Überschreibung der Update-Richtlinie“ ist auf einen der On-Zustände festgelegt (Updates immer zulassen, nur automatische automatische Updates, nur manuelle Updates).

Wenn Sie diese Richtlinie deaktivieren (0) oder nicht konfigurieren, bleiben Installationen unverändert, deren Version höher ist als die von „Außerkraftsetzung der Zielversion“ angegebene Version.

Wenn Sie diese Richtlinie aktivieren (1), werden Installationen, deren aktuelle Version höher als im „Außerkraftsetzung der Zielversion“ angegeben ist, auf die Zielversion herabgestuft.

Es wird empfohlen, dass Benutzer die neueste Version des Microsoft Edge-Browsers installieren, um den Schutz durch die neuesten Sicherheitsupdates sicherzustellen. Bei einem Rollback auf eine frühere Version besteht die Gefahr, dass bekannte Sicherheitsprobleme auftreten. Diese Richtlinie soll als temporärer Fix verwendet werden, um Probleme in einem Microsoft Edge Browserupdate zu beheben.

Vor dem vorübergehenden Rollback Ihrer Browserversion empfehlen wir, die Synchronisierung (https://go.microsoft.com/fwlink/?linkid=2133032) für alle Benutzer in Ihrer Organisation zu aktivieren. Wenn Sie die Synchronisierung nicht aktivieren, besteht das Risiko eines dauerhaften Datenverlusts beim Browsen. Verwenden Sie diese Richtlinie auf eigenes Risiko.

Hinweis: Alle für das Rollback verfügbaren Versionen können hier https://aka.ms/EdgeEnterprise angezeigt werden.

Diese Richtlinie gilt für Microsoft Edge, Version 86 oder höher.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2133918.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeBeta">Hiermit können Sie angeben, ob Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert sind.

  – Wenn Sie diese (1) Richtlinie aktivieren, werden Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert.

  – Wenn Sie diese (0) Richtlinie deaktivieren, können Benutzer im Windows-Insider-Programm nicht über Microsoft Edge Update in der Edge-Vorschau registriert werden.

  – Wenn Sie diese Richtlinie nicht konfigurieren, werden Benutzer im Windows-Insider-Programm standardmäßig über Microsoft Edge Update in der Edge-Vorschau registriert.</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdgeBeta">Gibt an, ob Microsoft Edge Update Verbindungen aktualisiert, die als getaktet gekennzeichnet sind, z. B. Mobilfunkverbindungen oder andere Verbindungen, bei denen die Datennutzung für den Microsoft Edge Browser gesteuert wird. 

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden Updates basierend auf der Umschaltfläche „Updates über getaktete Verbindungen herunterladen“ auf der Seite „Info“ des Microsoft Edge-Browsers ausgeführt. Wenn ein Benutzer keine Auswahl trifft, wird die Windows-Einstellung verwendet. Weitere Informationen zur Windows-Einstellung finden Sie hier: https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Updates immer zulassen (2): Updates werden immer heruntergeladen, wenn sie gefunden werden, entweder durch automatische Updateüberprüfung oder durch manuelle Updateüberprüfung.

Updates deaktivieren (1): Updates werden nicht heruntergeladen, wenn eine getaktete Verbindung verwendet wird.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdgeBeta">Sie können angeben, ob Microsoft Edge (stabiler Kanal) auf einer Domäne angehörenden Geräten im Europäischen Wirtschaftsraum (EWR) deinstalliert wird oder ob die Deinstallation blockiert wird.

Wenn diese Richtlinie auf „Aktiviert“ gesetzt ist, wird Microsoft Edge automatisch auf allen Geräten im EWR deinstalliert, auf denen diese Richtlinie angewendet wird. Benutzerdaten werden auf dem Gerät gespeichert. Microsoft Edge wird deinstalliert, wenn Microsoft Edge Update das nächste Mal automatisch nach Updates sucht. Wenn Microsoft Edge von den Geräten deinstalliert wird, sind Anwendungen, Widgets (z. B. Nachrichten, Suche und Wetter) oder andere progressive Webanwendungen (Progressive Web Applications, PWAs), die von Microsoft Edge abhängen, nicht mehr verfügbar.

Wenn diese Richtlinie auf „Aktiviert und Benutzerdaten löschen“ (Einstellung „2“) gesetzt ist, wird Microsoft Edge auf allen Geräten im EWR, auf denen diese Richtlinie angewendet wird, automatisch deinstalliert und die Benutzerdaten werden vom Gerät gelöscht.

Wenn diese Richtlinie auf „Deaktiviert“ (Einstellung „3“) gesetzt ist, können alle Benutzer im EWR dort, wo diese Richtlinie bereitgestellt wird, Microsoft Edge nicht deinstallieren.

Wenn die Richtlinie „Nicht konfiguriert“ (Standardeinstellung) ist, bestimmt die Windows-Regionaleinstellung eines Benutzers, ob er Microsoft Edge auf einem einer Domäne angehörenden Gerät deinstallieren kann. Nur Benutzer in EWR-Ländern können Microsoft Edge deinstallieren, wenn sie dies wünschen. Benutzer außerhalb dieses Gebiets können Microsoft Edge nicht deinstallieren. 

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die einer Microsoft® Active Directory®-Domäne beigetreten sind.

Wenn Microsoft Edge neu installiert werden muss:
– Sie können die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ setzen, um Microsoft Edge neu zu installieren.
– Wenn Sie die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ und die Deinstallationsrichtlinie auf „Aktiviert“ setzen, überschreibt die Richtlinie „Installationen erzwingen (computerübergreifend)“ die Deinstallationsrichtlinie.</string>
      <string id="Cat_MicrosoftEdgeDev">Microsoft Edge Dev</string>
      <string id="Explain_InstallMicrosoftEdgeDev">Gibt an, ob ein Microsoft Edge-Kanal auf einem mit einer Domäne verbunden Gerät installiert werden kann.

  Wenn Sie diese (1) Richtlinie für einen Kanal aktivieren, wird die Installation durch Microsoft Edge nicht blockiert.

  Wenn Sie diese (0) Richtlinie für einen Kanal deaktivieren, wird die Installation durch Microsoft Edge blockiert.

  Wenn Sie diese Richtlinie für einen Kanal nicht konfigurieren, bestimmt die Richtlinie „Standardeinstellung für Installation zulassen“, ob Benutzer diesen Microsoft Edge-Kanal installieren können.

Wenn Sie diese Richtlinie so festlegen, dass Machine-Wide Installationen, aber nicht Per-User Installationen (4) immer zugelassen werden, wird "APP_NAME" nur computerweit bereitgestellt.

Wenn Sie diese Richtlinie auf „Installation erzwingen (computerweit)“ festlegen (5), kann „APP_NAME“ nur computerweit bereitgestellt werden, wenn Microsoft Edge Update vorinstalliert ist. Erfordert Microsoft Edge Update 1.3.155.43 oder höher.

Wenn Sie diese Richtlinie auf „Installation erzwingen (pro Benutzer)“ festlegen (6), kann „APP_NAME“ auf allen Computern nur auf einer Pro-Benutzer-Basis bereitgestellt werden, wenn Microsoft Edge Update pro Benutzer vorinstalliert ist. Erfordert Microsoft Edge Update 1.3.155.43 oder höher.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeDev">Gibt an, wie Microsoft Edge Update mit verfügbaren Updates von Microsoft Edge umgeht.

Wenn Sie diese Richtlinie aktivieren, werden Microsoft Edge-Updates von Microsoft Edge Update entsprechend der Konfiguration der folgenden Optionen verarbeitet:
  – Updates deaktiviert (0): Updates werden nie angewendet.
  – Updates immer zulassen (1) (empfohlen): Jedes gefundene Update wird angewendet, sowohl bei regelmäßigen als auch bei manuellen Prüfungen auf Updates.
  – Nur manuelle Updates (2): Updates werden nur angewendet, wenn der Benutzer manuell nach Updates sucht. (Nicht alle Apps stellen eine Schnittstelle für diese Option bereit.)
  – Nur automatische unbeaufsichtigte Updates (3): Updates werden nur angewendet, wenn sie bei der regelmäßigen Überprüfung auf Updates gefunden werden.

Wenn Sie „Manuelle Updates“ auswählen, sollten Sie mithilfe des manuellen Updatemechanismus der App (falls verfügbar) regelmäßig nach Updates suchen. Wenn Sie Updates deaktivieren, sollten Sie regelmäßig nach Updates suchen und diese an die Benutzer verteilen.

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden die verfügbaren Updates von Microsoft Edge Update gemäß der Richtlinie „Standardeinstellung für die Überschreibung von Update-Richtlinien“ behandelt.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136406.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeDev">Gibt an, auf welchen Kanal Microsoft Edge aktualisiert werden soll.

Wenn Sie diese Richtlinie aktivieren, wird Microsoft Edge entsprechend Ihrer Konfiguration der folgenden Optionen auf den Kanal aktualisiert:

  – Stabil: Microsoft Edge wird auf die neueste stabile Version aktualisiert.
  – Beta: Microsoft Edge wird auf die neueste Betaversion aktualisiert.
  –Dev: Microsoft Edge wird auf die neueste Entwicklerversion aktualisiert.
  – Stabil (erweitert): Microsoft Edge wird auf die neueste erweiterte stabile Version aktualisiert, die einem längeren Releaseintervall folgt als die stabile Version. Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2163508.

Wenn Sie diese Richtlinie nicht konfigurieren, wird Microsoft Edge auf die neueste Version aktualisiert, die für den Standardkanal verfügbar ist.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeDev">Wenn diese Richtlinie sowie die automatische Aktualisierung aktiviert sind, wird Microsoft Edge auf die Version aktualisiert, die durch diesen Richtlinienwert angegeben wird.

Bei dem Richtlinienwert muss es sich um eine bestimmte Microsoft Edge-Version handeln, z. B. 83.0.499.12.

Wenn auf einem Gerät eine neuere Microsoft Edge-Version als der angegebene Wert vorhanden ist, wird Microsoft Edge in der neueren Version belassen und nicht auf die angegebene Version herabgestuft.

Wenn die angegebene Version nicht vorhanden ist oder nicht ordnungsgemäß formatiert ist, wird Microsoft Edge in der aktuellen Version belassen und nicht automatisch auf zukünftige Versionen aktualisiert.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136707.

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die sich innerhalb einer Microsoft® Active Directory®-Domäne befinden.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeDev">Gibt an, dass Microsoft Edge Update Installationen von Microsoft Edge auf die in „Außerkraftsetzung der Zielversion“ angegebene Version zurücksetzen sollen.

Diese Richtlinie hat keine Auswirkung, es sei denn, „Außerkraftsetzung der Zielversion“ ist festgelegt und „Überschreibung der Update-Richtlinie“ ist auf einen der On-Zustände festgelegt (Updates immer zulassen, nur automatische automatische Updates, nur manuelle Updates).

Wenn Sie diese Richtlinie deaktivieren (0) oder nicht konfigurieren, bleiben Installationen unverändert, deren Version höher ist als die von „Außerkraftsetzung der Zielversion“ angegebene Version.

Wenn Sie diese Richtlinie aktivieren (1), werden Installationen, deren aktuelle Version höher als im „Außerkraftsetzung der Zielversion“ angegeben ist, auf die Zielversion herabgestuft.

Es wird empfohlen, dass Benutzer die neueste Version des Microsoft Edge-Browsers installieren, um den Schutz durch die neuesten Sicherheitsupdates sicherzustellen. Bei einem Rollback auf eine frühere Version besteht die Gefahr, dass bekannte Sicherheitsprobleme auftreten. Diese Richtlinie soll als temporärer Fix verwendet werden, um Probleme in einem Microsoft Edge Browserupdate zu beheben.

Vor dem vorübergehenden Rollback Ihrer Browserversion empfehlen wir, die Synchronisierung (https://go.microsoft.com/fwlink/?linkid=2133032) für alle Benutzer in Ihrer Organisation zu aktivieren. Wenn Sie die Synchronisierung nicht aktivieren, besteht das Risiko eines dauerhaften Datenverlusts beim Browsen. Verwenden Sie diese Richtlinie auf eigenes Risiko.

Hinweis: Alle für das Rollback verfügbaren Versionen können hier https://aka.ms/EdgeEnterprise angezeigt werden.

Diese Richtlinie gilt für Microsoft Edge, Version 86 oder höher.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2133918.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeDev">Hiermit können Sie angeben, ob Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert sind.

  – Wenn Sie diese (1) Richtlinie aktivieren, werden Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert.

  – Wenn Sie diese (0) Richtlinie deaktivieren, können Benutzer im Windows-Insider-Programm nicht über Microsoft Edge Update in der Edge-Vorschau registriert werden.

  – Wenn Sie diese Richtlinie nicht konfigurieren, werden Benutzer im Windows-Insider-Programm standardmäßig über Microsoft Edge Update in der Edge-Vorschau registriert.</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdgeDev">Gibt an, ob Microsoft Edge Update Verbindungen aktualisiert, die als getaktet gekennzeichnet sind, z. B. Mobilfunkverbindungen oder andere Verbindungen, bei denen die Datennutzung für den Microsoft Edge Browser gesteuert wird. 

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden Updates basierend auf der Umschaltfläche „Updates über getaktete Verbindungen herunterladen“ auf der Seite „Info“ des Microsoft Edge-Browsers ausgeführt. Wenn ein Benutzer keine Auswahl trifft, wird die Windows-Einstellung verwendet. Weitere Informationen zur Windows-Einstellung finden Sie hier: https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Updates immer zulassen (2): Updates werden immer heruntergeladen, wenn sie gefunden werden, entweder durch automatische Updateüberprüfung oder durch manuelle Updateüberprüfung.

Updates deaktivieren (1): Updates werden nicht heruntergeladen, wenn eine getaktete Verbindung verwendet wird.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdgeDev">Sie können angeben, ob Microsoft Edge (stabiler Kanal) auf einer Domäne angehörenden Geräten im Europäischen Wirtschaftsraum (EWR) deinstalliert wird oder ob die Deinstallation blockiert wird.

Wenn diese Richtlinie auf „Aktiviert“ gesetzt ist, wird Microsoft Edge automatisch auf allen Geräten im EWR deinstalliert, auf denen diese Richtlinie angewendet wird. Benutzerdaten werden auf dem Gerät gespeichert. Microsoft Edge wird deinstalliert, wenn Microsoft Edge Update das nächste Mal automatisch nach Updates sucht. Wenn Microsoft Edge von den Geräten deinstalliert wird, sind Anwendungen, Widgets (z. B. Nachrichten, Suche und Wetter) oder andere progressive Webanwendungen (Progressive Web Applications, PWAs), die von Microsoft Edge abhängen, nicht mehr verfügbar.

Wenn diese Richtlinie auf „Aktiviert und Benutzerdaten löschen“ (Einstellung „2“) gesetzt ist, wird Microsoft Edge auf allen Geräten im EWR, auf denen diese Richtlinie angewendet wird, automatisch deinstalliert und die Benutzerdaten werden vom Gerät gelöscht.

Wenn diese Richtlinie auf „Deaktiviert“ (Einstellung „3“) gesetzt ist, können alle Benutzer im EWR dort, wo diese Richtlinie bereitgestellt wird, Microsoft Edge nicht deinstallieren.

Wenn die Richtlinie „Nicht konfiguriert“ (Standardeinstellung) ist, bestimmt die Windows-Regionaleinstellung eines Benutzers, ob er Microsoft Edge auf einem einer Domäne angehörenden Gerät deinstallieren kann. Nur Benutzer in EWR-Ländern können Microsoft Edge deinstallieren, wenn sie dies wünschen. Benutzer außerhalb dieses Gebiets können Microsoft Edge nicht deinstallieren. 

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die einer Microsoft® Active Directory®-Domäne beigetreten sind.

Wenn Microsoft Edge neu installiert werden muss:
– Sie können die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ setzen, um Microsoft Edge neu zu installieren.
– Wenn Sie die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ und die Deinstallationsrichtlinie auf „Aktiviert“ setzen, überschreibt die Richtlinie „Installationen erzwingen (computerübergreifend)“ die Deinstallationsrichtlinie.</string>
      <string id="Cat_MicrosoftEdgeCanary">Microsoft Edge Canary</string>
      <string id="Explain_InstallMicrosoftEdgeCanary">Gibt an, ob ein Microsoft Edge-Kanal auf einem mit einer Domäne verbunden Gerät installiert werden kann.

  Wenn Sie diese (1) Richtlinie für einen Kanal aktivieren, wird die Installation durch Microsoft Edge nicht blockiert.

  Wenn Sie diese (0) Richtlinie für einen Kanal deaktivieren, wird die Installation durch Microsoft Edge blockiert.

  Wenn Sie diese Richtlinie für einen Kanal nicht konfigurieren, bestimmt die Richtlinie „Standardeinstellung für Installation zulassen“, ob Benutzer diesen Microsoft Edge-Kanal installieren können.

Wenn Sie diese Richtlinie auf „Installation erzwingen (pro Benutzer)“ festlegen (6), kann „APP_NAME“ auf allen Computern nur auf einer Pro-Benutzer-Basis bereitgestellt werden, wenn Microsoft Edge Update pro Benutzer vorinstalliert ist. Erfordert Microsoft Edge Update 1.3.155.43 oder höher.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeCanary">Gibt an, wie Microsoft Edge Update mit verfügbaren Updates von Microsoft Edge umgeht.

Wenn Sie diese Richtlinie aktivieren, werden Microsoft Edge-Updates von Microsoft Edge Update entsprechend der Konfiguration der folgenden Optionen verarbeitet:
  – Updates deaktiviert (0): Updates werden nie angewendet.
  – Updates immer zulassen (1) (empfohlen): Jedes gefundene Update wird angewendet, sowohl bei regelmäßigen als auch bei manuellen Prüfungen auf Updates.
  – Nur manuelle Updates (2): Updates werden nur angewendet, wenn der Benutzer manuell nach Updates sucht. (Nicht alle Apps stellen eine Schnittstelle für diese Option bereit.)
  – Nur automatische unbeaufsichtigte Updates (3): Updates werden nur angewendet, wenn sie bei der regelmäßigen Überprüfung auf Updates gefunden werden.

Wenn Sie „Manuelle Updates“ auswählen, sollten Sie mithilfe des manuellen Updatemechanismus der App (falls verfügbar) regelmäßig nach Updates suchen. Wenn Sie Updates deaktivieren, sollten Sie regelmäßig nach Updates suchen und diese an die Benutzer verteilen.

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden die verfügbaren Updates von Microsoft Edge Update gemäß der Richtlinie „Standardeinstellung für die Überschreibung von Update-Richtlinien“ behandelt.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136406.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeCanary">Gibt an, auf welchen Kanal Microsoft Edge aktualisiert werden soll.

Wenn Sie diese Richtlinie aktivieren, wird Microsoft Edge entsprechend Ihrer Konfiguration der folgenden Optionen auf den Kanal aktualisiert:

  – Stabil: Microsoft Edge wird auf die neueste stabile Version aktualisiert.
  – Beta: Microsoft Edge wird auf die neueste Betaversion aktualisiert.
  –Dev: Microsoft Edge wird auf die neueste Entwicklerversion aktualisiert.
  – Stabil (erweitert): Microsoft Edge wird auf die neueste erweiterte stabile Version aktualisiert, die einem längeren Releaseintervall folgt als die stabile Version. Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2163508.

Wenn Sie diese Richtlinie nicht konfigurieren, wird Microsoft Edge auf die neueste Version aktualisiert, die für den Standardkanal verfügbar ist.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeCanary">Wenn diese Richtlinie sowie die automatische Aktualisierung aktiviert sind, wird Microsoft Edge auf die Version aktualisiert, die durch diesen Richtlinienwert angegeben wird.

Bei dem Richtlinienwert muss es sich um eine bestimmte Microsoft Edge-Version handeln, z. B. 83.0.499.12.

Wenn auf einem Gerät eine neuere Microsoft Edge-Version als der angegebene Wert vorhanden ist, wird Microsoft Edge in der neueren Version belassen und nicht auf die angegebene Version herabgestuft.

Wenn die angegebene Version nicht vorhanden ist oder nicht ordnungsgemäß formatiert ist, wird Microsoft Edge in der aktuellen Version belassen und nicht automatisch auf zukünftige Versionen aktualisiert.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136707.

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die sich innerhalb einer Microsoft® Active Directory®-Domäne befinden.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeCanary">Gibt an, dass Microsoft Edge Update Installationen von Microsoft Edge auf die in „Außerkraftsetzung der Zielversion“ angegebene Version zurücksetzen sollen.

Diese Richtlinie hat keine Auswirkung, es sei denn, „Außerkraftsetzung der Zielversion“ ist festgelegt und „Überschreibung der Update-Richtlinie“ ist auf einen der On-Zustände festgelegt (Updates immer zulassen, nur automatische automatische Updates, nur manuelle Updates).

Wenn Sie diese Richtlinie deaktivieren (0) oder nicht konfigurieren, bleiben Installationen unverändert, deren Version höher ist als die von „Außerkraftsetzung der Zielversion“ angegebene Version.

Wenn Sie diese Richtlinie aktivieren (1), werden Installationen, deren aktuelle Version höher als im „Außerkraftsetzung der Zielversion“ angegeben ist, auf die Zielversion herabgestuft.

Es wird empfohlen, dass Benutzer die neueste Version des Microsoft Edge-Browsers installieren, um den Schutz durch die neuesten Sicherheitsupdates sicherzustellen. Bei einem Rollback auf eine frühere Version besteht die Gefahr, dass bekannte Sicherheitsprobleme auftreten. Diese Richtlinie soll als temporärer Fix verwendet werden, um Probleme in einem Microsoft Edge Browserupdate zu beheben.

Vor dem vorübergehenden Rollback Ihrer Browserversion empfehlen wir, die Synchronisierung (https://go.microsoft.com/fwlink/?linkid=2133032) für alle Benutzer in Ihrer Organisation zu aktivieren. Wenn Sie die Synchronisierung nicht aktivieren, besteht das Risiko eines dauerhaften Datenverlusts beim Browsen. Verwenden Sie diese Richtlinie auf eigenes Risiko.

Hinweis: Alle für das Rollback verfügbaren Versionen können hier https://aka.ms/EdgeEnterprise angezeigt werden.

Diese Richtlinie gilt für Microsoft Edge, Version 86 oder höher.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2133918.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeCanary">Hiermit können Sie angeben, ob Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert sind.

  – Wenn Sie diese (1) Richtlinie aktivieren, werden Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert.

  – Wenn Sie diese (0) Richtlinie deaktivieren, können Benutzer im Windows-Insider-Programm nicht über Microsoft Edge Update in der Edge-Vorschau registriert werden.

  – Wenn Sie diese Richtlinie nicht konfigurieren, werden Benutzer im Windows-Insider-Programm standardmäßig über Microsoft Edge Update in der Edge-Vorschau registriert.</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdgeCanary">Gibt an, ob Microsoft Edge Update Verbindungen aktualisiert, die als getaktet gekennzeichnet sind, z. B. Mobilfunkverbindungen oder andere Verbindungen, bei denen die Datennutzung für den Microsoft Edge Browser gesteuert wird. 

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden Updates basierend auf der Umschaltfläche „Updates über getaktete Verbindungen herunterladen“ auf der Seite „Info“ des Microsoft Edge-Browsers ausgeführt. Wenn ein Benutzer keine Auswahl trifft, wird die Windows-Einstellung verwendet. Weitere Informationen zur Windows-Einstellung finden Sie hier: https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Updates immer zulassen (2): Updates werden immer heruntergeladen, wenn sie gefunden werden, entweder durch automatische Updateüberprüfung oder durch manuelle Updateüberprüfung.

Updates deaktivieren (1): Updates werden nicht heruntergeladen, wenn eine getaktete Verbindung verwendet wird.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdgeCanary">Sie können angeben, ob Microsoft Edge (stabiler Kanal) auf einer Domäne angehörenden Geräten im Europäischen Wirtschaftsraum (EWR) deinstalliert wird oder ob die Deinstallation blockiert wird.

Wenn diese Richtlinie auf „Aktiviert“ gesetzt ist, wird Microsoft Edge automatisch auf allen Geräten im EWR deinstalliert, auf denen diese Richtlinie angewendet wird. Benutzerdaten werden auf dem Gerät gespeichert. Microsoft Edge wird deinstalliert, wenn Microsoft Edge Update das nächste Mal automatisch nach Updates sucht. Wenn Microsoft Edge von den Geräten deinstalliert wird, sind Anwendungen, Widgets (z. B. Nachrichten, Suche und Wetter) oder andere progressive Webanwendungen (Progressive Web Applications, PWAs), die von Microsoft Edge abhängen, nicht mehr verfügbar.

Wenn diese Richtlinie auf „Aktiviert und Benutzerdaten löschen“ (Einstellung „2“) gesetzt ist, wird Microsoft Edge auf allen Geräten im EWR, auf denen diese Richtlinie angewendet wird, automatisch deinstalliert und die Benutzerdaten werden vom Gerät gelöscht.

Wenn diese Richtlinie auf „Deaktiviert“ (Einstellung „3“) gesetzt ist, können alle Benutzer im EWR dort, wo diese Richtlinie bereitgestellt wird, Microsoft Edge nicht deinstallieren.

Wenn die Richtlinie „Nicht konfiguriert“ (Standardeinstellung) ist, bestimmt die Windows-Regionaleinstellung eines Benutzers, ob er Microsoft Edge auf einem einer Domäne angehörenden Gerät deinstallieren kann. Nur Benutzer in EWR-Ländern können Microsoft Edge deinstallieren, wenn sie dies wünschen. Benutzer außerhalb dieses Gebiets können Microsoft Edge nicht deinstallieren. 

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die einer Microsoft® Active Directory®-Domäne beigetreten sind.

Wenn Microsoft Edge neu installiert werden muss:
– Sie können die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ setzen, um Microsoft Edge neu zu installieren.
– Wenn Sie die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ und die Deinstallationsrichtlinie auf „Aktiviert“ setzen, überschreibt die Richtlinie „Installationen erzwingen (computerübergreifend)“ die Deinstallationsrichtlinie.</string>
      <string id="Cat_MicrosoftEdgeWebView">Microsoft Edge WebView</string>
      <string id="Explain_InstallMicrosoftEdgeWebView">Gibt an, ob ein Microsoft Edge-Kanal auf einem mit einer Domäne verbunden Gerät installiert werden kann.

  Wenn Sie diese (1) Richtlinie für einen Kanal aktivieren, wird die Installation durch Microsoft Edge nicht blockiert.

  Wenn Sie diese (0) Richtlinie für einen Kanal deaktivieren, wird die Installation durch Microsoft Edge blockiert.

  Wenn Sie diese Richtlinie für einen Kanal nicht konfigurieren, bestimmt die Richtlinie „Standardeinstellung für Installation zulassen“, ob Benutzer diesen Microsoft Edge-Kanal installieren können.

Wenn Sie diese Richtlinie so festlegen, dass Machine-Wide Installationen, aber nicht Per-User Installationen (4) immer zugelassen werden, wird "APP_NAME" nur computerweit bereitgestellt.

Wenn Sie diese Richtlinie auf „Installation erzwingen (computerweit)“ festlegen (5), kann „APP_NAME“ nur computerweit bereitgestellt werden, wenn Microsoft Edge Update vorinstalliert ist. Erfordert Microsoft Edge Update 1.3.155.43 oder höher.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeWebView">Gibt an, wie Microsoft Edge Update mit verfügbaren Updates von Microsoft Edge umgeht.

Wenn Sie diese Richtlinie aktivieren, werden Microsoft Edge-Updates von Microsoft Edge Update entsprechend der Konfiguration der folgenden Optionen verarbeitet:
  – Updates deaktiviert (0): Updates werden nie angewendet.
  – Updates immer zulassen (1) (empfohlen): Jedes gefundene Update wird angewendet, sowohl bei regelmäßigen als auch bei manuellen Prüfungen auf Updates.
  – Nur manuelle Updates (2): Updates werden nur angewendet, wenn der Benutzer manuell nach Updates sucht. (Nicht alle Apps stellen eine Schnittstelle für diese Option bereit.)
  – Nur automatische unbeaufsichtigte Updates (3): Updates werden nur angewendet, wenn sie bei der regelmäßigen Überprüfung auf Updates gefunden werden.

Wenn Sie „Manuelle Updates“ auswählen, sollten Sie mithilfe des manuellen Updatemechanismus der App (falls verfügbar) regelmäßig nach Updates suchen. Wenn Sie Updates deaktivieren, sollten Sie regelmäßig nach Updates suchen und diese an die Benutzer verteilen.

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden die verfügbaren Updates von Microsoft Edge Update gemäß der Richtlinie „Standardeinstellung für die Überschreibung von Update-Richtlinien“ behandelt.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136406.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeWebView">Gibt an, auf welchen Kanal Microsoft Edge aktualisiert werden soll.

Wenn Sie diese Richtlinie aktivieren, wird Microsoft Edge entsprechend Ihrer Konfiguration der folgenden Optionen auf den Kanal aktualisiert:

  – Stabil: Microsoft Edge wird auf die neueste stabile Version aktualisiert.
  – Beta: Microsoft Edge wird auf die neueste Betaversion aktualisiert.
  –Dev: Microsoft Edge wird auf die neueste Entwicklerversion aktualisiert.
  – Stabil (erweitert): Microsoft Edge wird auf die neueste erweiterte stabile Version aktualisiert, die einem längeren Releaseintervall folgt als die stabile Version. Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2163508.

Wenn Sie diese Richtlinie nicht konfigurieren, wird Microsoft Edge auf die neueste Version aktualisiert, die für den Standardkanal verfügbar ist.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeWebView">Wenn diese Richtlinie sowie die automatische Aktualisierung aktiviert sind, wird Microsoft Edge auf die Version aktualisiert, die durch diesen Richtlinienwert angegeben wird.

Bei dem Richtlinienwert muss es sich um eine bestimmte Microsoft Edge-Version handeln, z. B. 83.0.499.12.

Wenn auf einem Gerät eine neuere Microsoft Edge-Version als der angegebene Wert vorhanden ist, wird Microsoft Edge in der neueren Version belassen und nicht auf die angegebene Version herabgestuft.

Wenn die angegebene Version nicht vorhanden ist oder nicht ordnungsgemäß formatiert ist, wird Microsoft Edge in der aktuellen Version belassen und nicht automatisch auf zukünftige Versionen aktualisiert.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2136707.

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die sich innerhalb einer Microsoft® Active Directory®-Domäne befinden.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeWebView">Gibt an, dass Microsoft Edge Update Installationen von Microsoft Edge auf die in „Außerkraftsetzung der Zielversion“ angegebene Version zurücksetzen sollen.

Diese Richtlinie hat keine Auswirkung, es sei denn, „Außerkraftsetzung der Zielversion“ ist festgelegt und „Überschreibung der Update-Richtlinie“ ist auf einen der On-Zustände festgelegt (Updates immer zulassen, nur automatische automatische Updates, nur manuelle Updates).

Wenn Sie diese Richtlinie deaktivieren (0) oder nicht konfigurieren, bleiben Installationen unverändert, deren Version höher ist als die von „Außerkraftsetzung der Zielversion“ angegebene Version.

Wenn Sie diese Richtlinie aktivieren (1), werden Installationen, deren aktuelle Version höher als im „Außerkraftsetzung der Zielversion“ angegeben ist, auf die Zielversion herabgestuft.

Es wird empfohlen, dass Benutzer die neueste Version des Microsoft Edge-Browsers installieren, um den Schutz durch die neuesten Sicherheitsupdates sicherzustellen. Bei einem Rollback auf eine frühere Version besteht die Gefahr, dass bekannte Sicherheitsprobleme auftreten. Diese Richtlinie soll als temporärer Fix verwendet werden, um Probleme in einem Microsoft Edge Browserupdate zu beheben.

Vor dem vorübergehenden Rollback Ihrer Browserversion empfehlen wir, die Synchronisierung (https://go.microsoft.com/fwlink/?linkid=2133032) für alle Benutzer in Ihrer Organisation zu aktivieren. Wenn Sie die Synchronisierung nicht aktivieren, besteht das Risiko eines dauerhaften Datenverlusts beim Browsen. Verwenden Sie diese Richtlinie auf eigenes Risiko.

Hinweis: Alle für das Rollback verfügbaren Versionen können hier https://aka.ms/EdgeEnterprise angezeigt werden.

Diese Richtlinie gilt für Microsoft Edge, Version 86 oder höher.

Weitere Informationen finden Sie unter https://go.microsoft.com/fwlink/?linkid=2133918.

Diese Richtlinie ist nur für Windows-Instanzen verfügbar, die einer Domäne von Microsoft® Active Directory® beigetreten sind.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeWebView">Hiermit können Sie angeben, ob Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert sind.

  – Wenn Sie diese (1) Richtlinie aktivieren, werden Benutzer im Windows-Insider-Programm über Microsoft Edge Update in der Edge-Vorschau registriert.

  – Wenn Sie diese (0) Richtlinie deaktivieren, können Benutzer im Windows-Insider-Programm nicht über Microsoft Edge Update in der Edge-Vorschau registriert werden.

  – Wenn Sie diese Richtlinie nicht konfigurieren, werden Benutzer im Windows-Insider-Programm standardmäßig über Microsoft Edge Update in der Edge-Vorschau registriert.</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdgeWebView">Gibt an, ob Microsoft Edge Update Verbindungen aktualisiert, die als getaktet gekennzeichnet sind, z. B. Mobilfunkverbindungen oder andere Verbindungen, bei denen die Datennutzung für den Microsoft Edge Browser gesteuert wird. 

Wenn Sie diese Richtlinie nicht aktivieren und konfigurieren, werden Updates basierend auf der Umschaltfläche „Updates über getaktete Verbindungen herunterladen“ auf der Seite „Info“ des Microsoft Edge-Browsers ausgeführt. Wenn ein Benutzer keine Auswahl trifft, wird die Windows-Einstellung verwendet. Weitere Informationen zur Windows-Einstellung finden Sie hier: https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Updates immer zulassen (2): Updates werden immer heruntergeladen, wenn sie gefunden werden, entweder durch automatische Updateüberprüfung oder durch manuelle Updateüberprüfung.

Updates deaktivieren (1): Updates werden nicht heruntergeladen, wenn eine getaktete Verbindung verwendet wird.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdgeWebView">Sie können angeben, ob Microsoft Edge (stabiler Kanal) auf einer Domäne angehörenden Geräten im Europäischen Wirtschaftsraum (EWR) deinstalliert wird oder ob die Deinstallation blockiert wird.

Wenn diese Richtlinie auf „Aktiviert“ gesetzt ist, wird Microsoft Edge automatisch auf allen Geräten im EWR deinstalliert, auf denen diese Richtlinie angewendet wird. Benutzerdaten werden auf dem Gerät gespeichert. Microsoft Edge wird deinstalliert, wenn Microsoft Edge Update das nächste Mal automatisch nach Updates sucht. Wenn Microsoft Edge von den Geräten deinstalliert wird, sind Anwendungen, Widgets (z. B. Nachrichten, Suche und Wetter) oder andere progressive Webanwendungen (Progressive Web Applications, PWAs), die von Microsoft Edge abhängen, nicht mehr verfügbar.

Wenn diese Richtlinie auf „Aktiviert und Benutzerdaten löschen“ (Einstellung „2“) gesetzt ist, wird Microsoft Edge auf allen Geräten im EWR, auf denen diese Richtlinie angewendet wird, automatisch deinstalliert und die Benutzerdaten werden vom Gerät gelöscht.

Wenn diese Richtlinie auf „Deaktiviert“ (Einstellung „3“) gesetzt ist, können alle Benutzer im EWR dort, wo diese Richtlinie bereitgestellt wird, Microsoft Edge nicht deinstallieren.

Wenn die Richtlinie „Nicht konfiguriert“ (Standardeinstellung) ist, bestimmt die Windows-Regionaleinstellung eines Benutzers, ob er Microsoft Edge auf einem einer Domäne angehörenden Gerät deinstallieren kann. Nur Benutzer in EWR-Ländern können Microsoft Edge deinstallieren, wenn sie dies wünschen. Benutzer außerhalb dieses Gebiets können Microsoft Edge nicht deinstallieren. 

Diese Richtlinie ist nur auf Windows-Instanzen verfügbar, die einer Microsoft® Active Directory®-Domäne beigetreten sind.

Wenn Microsoft Edge neu installiert werden muss:
– Sie können die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ setzen, um Microsoft Edge neu zu installieren.
– Wenn Sie die Installationsrichtlinie auf „Installationen erzwingen (computerübergreifend)“ und die Deinstallationsrichtlinie auf „Aktiviert“ setzen, überschreibt die Richtlinie „Installationen erzwingen (computerübergreifend)“ die Deinstallationsrichtlinie.</string>
    </stringTable>
    <presentationTable>
      <presentation id="Pol_AutoUpdateCheckPeriod">
        <decimalTextBox refId="Part_AutoUpdateCheckPeriod" defaultValue="1400"
            spinStep="60">Minuten zwischen Updateüberprüfungen</decimalTextBox>
      </presentation>
      <presentation id="Pol_UpdateCheckSuppressedPeriod">
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartHour"
            defaultValue="0" spinStep="1">Stunde</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartMin"
            defaultValue="0" spinStep="1">Minute</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedDurationMin"
            defaultValue="60">Dauer</decimalTextBox>
      </presentation>
      <presentation id="Pol_DownloadPreference">
        <dropdownList refId="Part_DownloadPreference"
            defaultItem="0">Typ der anzufordernden Download-URL</dropdownList>
      </presentation>
      <presentation id="Pol_ProxyMode">
        <dropdownList refId="Part_ProxyMode"
            defaultItem="0">Auswählen, wie Proxyservereinstellungen angegeben werden sollen</dropdownList>
      </presentation>
      <presentation id="Pol_ProxyServer">
        <textBox refId="Part_ProxyServer">
          <label>Adresse oder URL eines Proxyservers</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_ProxyPacUrl">
        <textBox refId="Part_ProxyPacUrl">
          <label>URL zu Proxy .PAC-Datei</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_DefaultUpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Richtlinie aktualisieren</dropdownList>
      </presentation>
      <presentation id="Pol_UpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Richtlinie aktualisieren</dropdownList>
      </presentation>
      <presentation id="Pol_TargetVersionPrefix">
        <textBox refId="Part_TargetVersionPrefix">
          <label>Zielversion</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_ECSControl">
        <dropdownList refId="Part_ECSControl"
            defaultItem="1">Kommunikation des Updaters mit Experimentier- und Konfigurationsdienst steuern</dropdownList>
      </presentation>
      <presentation id="Pol_TargetChannel" >
        <dropdownList refId="Part_TargetChannel"
            defaultItem="0">Zielkanal
        </dropdownList>
      </presentation>
      <presentation id="Pol_DefaultRemoveDesktopShortcut">
        <dropdownList refId="Part_RemoveDesktopShortcut"
            defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="Pol_RemoveDesktopShortcut">
        <dropdownList refId="Part_RemoveDesktopShortcut"
            defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="Pol_DefaultCreateDesktopShortcut" />
      <presentation id="Pol_CreateDesktopShortcut" />
      <presentation id="Pol_RollbackToTargetVersion" />
      <presentation id="Pol_EdgePreview" />
      <presentation id="Pol_DefaultMeteredUpdates">
        <dropdownList refId="Part_DefaultMeteredUpdatesPolicy"
            defaultItem="0">Richtlinie für standardmäßige getaktete Updates</dropdownList>
      </presentation>
      <presentation id="Pol_MeteredUpdates">
        <dropdownList refId="Part_MeteredUpdatesPolicy"
            defaultItem="0">Richtlinie für getaktete Updates</dropdownList>
      </presentation>
      <presentation id="Pol_UninstallEdge">
        <dropdownList refId="Part_UninstallEdgePolicy"
            defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="Pol_AllowSideBySideExperience" />
      <presentation id="Pol_DefaultAllowInstallation">
        <dropdownList refId="Part_InstallPolicy"
            defaultItem="0">Installationsrichtlinie</dropdownList>
      </presentation>
      <presentation id="Pol_AllowInstallation">
        <dropdownList refId="Part_InstallPolicy"
            defaultItem="0">Installationsrichtlinie</dropdownList>
      </presentation>

    </presentationTable>
  </resources>
</policyDefinitionResources>